/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача: 
// Написать программу, которая из имеющегося массива строк формирует массив строк, меньше или равна 3 символам.
// Первоночальный массив вводится с клавиатуры или задается на старте.выполнения алгоритма.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//***************************************************************************************************************************************************************************************
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Метод для вывода одномерного массива строк в консоль
void Print1DArry(string[] array)
{
for (int i = 0; i < array.GetLength(0); i++)
{
Console.Write($"[{array[i]}]\t");
}
}

// Метод, который находит строки в массиве длиной не больше count
// И возвращает новый массив из этих строк
string[] GetNewArray(string[] array, int count)
{
string[] result = new string[0];
for (int index = 0; index < array.Length; index++)
{
if (array[index].Length <= count)
{
result = result.Concat(new string[] { array[index] }).ToArray();
}
}
return result;
}

// Запросить у пользователя ввод элементов массива через пробел
Console.WriteLine("Введите элементы массива через пробел:");
string input = Console.ReadLine()?? "0";
string[] strarray = input.Split(' ');

// Получить новый массив из строк, длина которых не больше 3
string[] newArray = GetNewArray(strarray, 3);

// Вывести исходный массив и новый массив в консоль
Console.WriteLine("Исходный массив:");
Print1DArry(strarray);
Console.WriteLine();
Console.WriteLine("Массив из строк длина которых не превышает 3:");

if (newArray.Length != 0)
{
Print1DArry(newArray);
}
else
{
Console.WriteLine("Массив пустой!!!");
}